{"modelTopology":{"class_name":"Model","config":{"name":"sequential_1025_model","layers":[{"name":"dense_Dense205_input","class_name":"InputLayer","config":{"batch_input_shape":[null,15],"dtype":"float32","sparse":false,"name":"dense_Dense205_input"},"inbound_nodes":[]},{"name":"dense_Dense205","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense205","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"},"inbound_nodes":[[["dense_Dense205_input",0,0,{}]]]},{"name":"dense_Dense206","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense206","trainable":true},"inbound_nodes":[[["dense_Dense205",0,0,{}]]]},{"name":"dense_Dense207","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense207","trainable":true},"inbound_nodes":[[["dense_Dense206",0,0,{}]]]},{"name":"dense_Dense208","class_name":"Dense","config":{"units":6,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense208","trainable":true},"inbound_nodes":[[["dense_Dense207",0,0,{}]]]}],"input_layers":[["dense_Dense205_input",0,0]],"output_layers":[["dense_Dense208",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense205/kernel","shape":[15,7],"dtype":"float32"},{"name":"dense_Dense205/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense206/kernel","shape":[7,7],"dtype":"float32"},{"name":"dense_Dense206/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense207/kernel","shape":[7,7],"dtype":"float32"},{"name":"dense_Dense207/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense208/kernel","shape":[7,6],"dtype":"float32"},{"name":"dense_Dense208/bias","shape":[6],"dtype":"float32"}]}]}