{"modelTopology":{"class_name":"Model","config":{"name":"sequential_1026_model","layers":[{"name":"dense_Dense1313_input","class_name":"InputLayer","config":{"batch_input_shape":[null,44],"dtype":"float32","sparse":false,"name":"dense_Dense1313_input"},"inbound_nodes":[]},{"name":"dense_Dense1313","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1313","trainable":true,"batch_input_shape":[null,44],"dtype":"float32"},"inbound_nodes":[[["dense_Dense1313_input",0,0,{}]]]},{"name":"dense_Dense1314","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1314","trainable":true},"inbound_nodes":[[["dense_Dense1313",0,0,{}]]]},{"name":"dense_Dense1315","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1315","trainable":true},"inbound_nodes":[[["dense_Dense1314",0,0,{}]]]},{"name":"dense_Dense1316","class_name":"Dense","config":{"units":3,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1316","trainable":true},"inbound_nodes":[[["dense_Dense1315",0,0,{}]]]}],"input_layers":[["dense_Dense1313_input",0,0]],"output_layers":[["dense_Dense1316",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense1313/kernel","shape":[44,7],"dtype":"float32"},{"name":"dense_Dense1313/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense1314/kernel","shape":[7,7],"dtype":"float32"},{"name":"dense_Dense1314/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense1315/kernel","shape":[7,7],"dtype":"float32"},{"name":"dense_Dense1315/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense1316/kernel","shape":[7,3],"dtype":"float32"},{"name":"dense_Dense1316/bias","shape":[3],"dtype":"float32"}]}]}