{"modelTopology":{"class_name":"Model","config":{"name":"sequential_1026_model","layers":[{"name":"dense_Dense2773_input","class_name":"InputLayer","config":{"batch_input_shape":[null,14],"dtype":"float32","sparse":false,"name":"dense_Dense2773_input"},"inbound_nodes":[]},{"name":"dense_Dense2773","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2773","trainable":true,"batch_input_shape":[null,14],"dtype":"float32"},"inbound_nodes":[[["dense_Dense2773_input",0,0,{}]]]},{"name":"dense_Dense2774","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2774","trainable":true},"inbound_nodes":[[["dense_Dense2773",0,0,{}]]]},{"name":"dense_Dense2775","class_name":"Dense","config":{"units":6,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2775","trainable":true},"inbound_nodes":[[["dense_Dense2774",0,0,{}]]]}],"input_layers":[["dense_Dense2773_input",0,0]],"output_layers":[["dense_Dense2775",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense2773/kernel","shape":[14,7],"dtype":"float32"},{"name":"dense_Dense2773/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense2774/kernel","shape":[7,7],"dtype":"float32"},{"name":"dense_Dense2774/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense2775/kernel","shape":[7,6],"dtype":"float32"},{"name":"dense_Dense2775/bias","shape":[6],"dtype":"float32"}]}]}