{"modelTopology":{"class_name":"Model","config":{"name":"sequential_9226_model","layers":[{"name":"dense_Dense27298_input","class_name":"InputLayer","config":{"batch_input_shape":[null,10],"dtype":"float32","sparse":false,"name":"dense_Dense27298_input"},"inbound_nodes":[]},{"name":"dense_Dense27298","class_name":"Dense","config":{"units":15,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense27298","trainable":true,"batch_input_shape":[null,10],"dtype":"float32"},"inbound_nodes":[[["dense_Dense27298_input",0,0,{}]]]},{"name":"dense_Dense27299","class_name":"Dense","config":{"units":15,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense27299","trainable":true},"inbound_nodes":[[["dense_Dense27298",0,0,{}]]]},{"name":"dense_Dense27300","class_name":"Dense","config":{"units":3,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense27300","trainable":true},"inbound_nodes":[[["dense_Dense27299",0,0,{}]]]}],"input_layers":[["dense_Dense27298_input",0,0]],"output_layers":[["dense_Dense27300",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel.json.weights.bin"],"weights":[{"name":"dense_Dense27298/kernel","shape":[10,15],"dtype":"float32"},{"name":"dense_Dense27298/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense27299/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense27299/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense27300/kernel","shape":[15,3],"dtype":"float32"},{"name":"dense_Dense27300/bias","shape":[3],"dtype":"float32"}]}]}