{"modelTopology":{"class_name":"Model","config":{"name":"sequential_5125_model","layers":[{"name":"dense_Dense11509_input","class_name":"InputLayer","config":{"batch_input_shape":[null,24],"dtype":"float32","sparse":false,"name":"dense_Dense11509_input"},"inbound_nodes":[]},{"name":"dense_Dense11509","class_name":"Dense","config":{"units":20,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11509","trainable":true,"batch_input_shape":[null,24],"dtype":"float32"},"inbound_nodes":[[["dense_Dense11509_input",0,0,{}]]]},{"name":"dense_Dense11510","class_name":"Dense","config":{"units":20,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11510","trainable":true},"inbound_nodes":[[["dense_Dense11509",0,0,{}]]]},{"name":"dense_Dense11511","class_name":"Dense","config":{"units":3,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11511","trainable":true},"inbound_nodes":[[["dense_Dense11510",0,0,{}]]]}],"input_layers":[["dense_Dense11509_input",0,0]],"output_layers":[["dense_Dense11511",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense11509/kernel","shape":[24,20],"dtype":"float32"},{"name":"dense_Dense11509/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense11510/kernel","shape":[20,20],"dtype":"float32"},{"name":"dense_Dense11510/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense11511/kernel","shape":[20,3],"dtype":"float32"},{"name":"dense_Dense11511/bias","shape":[3],"dtype":"float32"}]}]}