{"modelTopology":{"class_name":"Model","config":{"name":"sequential_1025_model","layers":[{"name":"dense_Dense3733_input","class_name":"InputLayer","config":{"batch_input_shape":[null,14],"dtype":"float32","sparse":false,"name":"dense_Dense3733_input"},"inbound_nodes":[]},{"name":"dense_Dense3733","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3733","trainable":true,"batch_input_shape":[null,14],"dtype":"float32"},"inbound_nodes":[[["dense_Dense3733_input",0,0,{}]]]},{"name":"dense_Dense3734","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3734","trainable":true},"inbound_nodes":[[["dense_Dense3733",0,0,{}]]]},{"name":"dense_Dense3735","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3735","trainable":true},"inbound_nodes":[[["dense_Dense3734",0,0,{}]]]},{"name":"dense_Dense3736","class_name":"Dense","config":{"units":6,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3736","trainable":true},"inbound_nodes":[[["dense_Dense3735",0,0,{}]]]}],"input_layers":[["dense_Dense3733_input",0,0]],"output_layers":[["dense_Dense3736",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense3733/kernel","shape":[14,7],"dtype":"float32"},{"name":"dense_Dense3733/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense3734/kernel","shape":[7,7],"dtype":"float32"},{"name":"dense_Dense3734/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense3735/kernel","shape":[7,7],"dtype":"float32"},{"name":"dense_Dense3735/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense3736/kernel","shape":[7,6],"dtype":"float32"},{"name":"dense_Dense3736/bias","shape":[6],"dtype":"float32"}]}]}