{"modelTopology":{"class_name":"Model","config":{"name":"sequential_259_model","layers":[{"name":"dense_Dense655_input","class_name":"InputLayer","config":{"batch_input_shape":[null,14],"dtype":"float32","sparse":false,"name":"dense_Dense655_input"},"inbound_nodes":[]},{"name":"dense_Dense655","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense655","trainable":true,"batch_input_shape":[null,14],"dtype":"float32"},"inbound_nodes":[[["dense_Dense655_input",0,0,{}]]]},{"name":"dense_Dense656","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense656","trainable":true},"inbound_nodes":[[["dense_Dense655",0,0,{}]]]},{"name":"dense_Dense657","class_name":"Dense","config":{"units":6,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense657","trainable":true},"inbound_nodes":[[["dense_Dense656",0,0,{}]]]}],"input_layers":[["dense_Dense655_input",0,0]],"output_layers":[["dense_Dense657",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense655/kernel","shape":[14,7],"dtype":"float32"},{"name":"dense_Dense655/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense656/kernel","shape":[7,7],"dtype":"float32"},{"name":"dense_Dense656/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense657/kernel","shape":[7,6],"dtype":"float32"},{"name":"dense_Dense657/bias","shape":[6],"dtype":"float32"}]}]}