{"modelTopology":{"class_name":"Model","config":{"name":"sequential_43524_model","layers":[{"name":"dense_Dense128386_input","class_name":"InputLayer","config":{"batch_input_shape":[null,26],"dtype":"float32","sparse":false,"name":"dense_Dense128386_input"},"inbound_nodes":[]},{"name":"dense_Dense128386","class_name":"Dense","config":{"units":22,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense128386","trainable":true,"batch_input_shape":[null,26],"dtype":"float32"},"inbound_nodes":[[["dense_Dense128386_input",0,0,{}]]]},{"name":"dense_Dense128387","class_name":"Dense","config":{"units":22,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense128387","trainable":true},"inbound_nodes":[[["dense_Dense128386",0,0,{}]]]},{"name":"dense_Dense128388","class_name":"Dense","config":{"units":3,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense128388","trainable":true},"inbound_nodes":[[["dense_Dense128387",0,0,{}]]]}],"input_layers":[["dense_Dense128386_input",0,0]],"output_layers":[["dense_Dense128388",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense128386/kernel","shape":[26,22],"dtype":"float32"},{"name":"dense_Dense128386/bias","shape":[22],"dtype":"float32"},{"name":"dense_Dense128387/kernel","shape":[22,22],"dtype":"float32"},{"name":"dense_Dense128387/bias","shape":[22],"dtype":"float32"},{"name":"dense_Dense128388/kernel","shape":[22,3],"dtype":"float32"},{"name":"dense_Dense128388/bias","shape":[3],"dtype":"float32"}]}]}