{"modelTopology":{"class_name":"Model","config":{"name":"sequential_56326_model","layers":[{"name":"dense_Dense166114_input","class_name":"InputLayer","config":{"batch_input_shape":[null,28],"dtype":"float32","sparse":false,"name":"dense_Dense166114_input"},"inbound_nodes":[]},{"name":"dense_Dense166114","class_name":"Dense","config":{"units":26,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense166114","trainable":true,"batch_input_shape":[null,28],"dtype":"float32"},"inbound_nodes":[[["dense_Dense166114_input",0,0,{}]]]},{"name":"dense_Dense166115","class_name":"Dense","config":{"units":26,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense166115","trainable":true},"inbound_nodes":[[["dense_Dense166114",0,0,{}]]]},{"name":"dense_Dense166116","class_name":"Dense","config":{"units":3,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense166116","trainable":true},"inbound_nodes":[[["dense_Dense166115",0,0,{}]]]}],"input_layers":[["dense_Dense166114_input",0,0]],"output_layers":[["dense_Dense166116",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense166114/kernel","shape":[28,26],"dtype":"float32"},{"name":"dense_Dense166114/bias","shape":[26],"dtype":"float32"},{"name":"dense_Dense166115/kernel","shape":[26,26],"dtype":"float32"},{"name":"dense_Dense166115/bias","shape":[26],"dtype":"float32"},{"name":"dense_Dense166116/kernel","shape":[26,3],"dtype":"float32"},{"name":"dense_Dense166116/bias","shape":[3],"dtype":"float32"}]}]}