{"modelTopology":{"class_name":"Model","config":{"name":"sequential_6147_model","layers":[{"name":"dense_Dense15361_input","class_name":"InputLayer","config":{"batch_input_shape":[null,12],"dtype":"float32","sparse":false,"name":"dense_Dense15361_input"},"inbound_nodes":[]},{"name":"dense_Dense15361","class_name":"Dense","config":{"units":10,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15361","trainable":true,"batch_input_shape":[null,12],"dtype":"float32"},"inbound_nodes":[[["dense_Dense15361_input",0,0,{}]]]},{"name":"dense_Dense15362","class_name":"Dense","config":{"units":10,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15362","trainable":true},"inbound_nodes":[[["dense_Dense15361",0,0,{}]]]},{"name":"dense_Dense15363","class_name":"Dense","config":{"units":3,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense15363","trainable":true},"inbound_nodes":[[["dense_Dense15362",0,0,{}]]]}],"input_layers":[["dense_Dense15361_input",0,0]],"output_layers":[["dense_Dense15363",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense15361/kernel","shape":[12,10],"dtype":"float32"},{"name":"dense_Dense15361/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense15362/kernel","shape":[10,10],"dtype":"float32"},{"name":"dense_Dense15362/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense15363/kernel","shape":[10,3],"dtype":"float32"},{"name":"dense_Dense15363/bias","shape":[3],"dtype":"float32"}]}]}