{"modelTopology":{"class_name":"Model","config":{"name":"sequential_10253_model","layers":[{"name":"dense_Dense28564_input","class_name":"InputLayer","config":{"batch_input_shape":[null,10],"dtype":"float32","sparse":false,"name":"dense_Dense28564_input"},"inbound_nodes":[]},{"name":"dense_Dense28564","class_name":"Dense","config":{"units":15,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense28564","trainable":true,"batch_input_shape":[null,10],"dtype":"float32"},"inbound_nodes":[[["dense_Dense28564_input",0,0,{}]]]},{"name":"dense_Dense28565","class_name":"Dense","config":{"units":15,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense28565","trainable":true},"inbound_nodes":[[["dense_Dense28564",0,0,{}]]]},{"name":"dense_Dense28566","class_name":"Dense","config":{"units":3,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense28566","trainable":true},"inbound_nodes":[[["dense_Dense28565",0,0,{}]]]}],"input_layers":[["dense_Dense28564_input",0,0]],"output_layers":[["dense_Dense28566",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel.json.weights.bin"],"weights":[{"name":"dense_Dense28564/kernel","shape":[10,15],"dtype":"float32"},{"name":"dense_Dense28564/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense28565/kernel","shape":[15,15],"dtype":"float32"},{"name":"dense_Dense28565/bias","shape":[15],"dtype":"float32"},{"name":"dense_Dense28566/kernel","shape":[15,3],"dtype":"float32"},{"name":"dense_Dense28566/bias","shape":[3],"dtype":"float32"}]}]}