{"modelTopology":{"class_name":"Model","config":{"name":"sequential_522_model","layers":[{"name":"dense_Dense1165_input","class_name":"InputLayer","config":{"batch_input_shape":[null,16],"dtype":"float32","sparse":false,"name":"dense_Dense1165_input"},"inbound_nodes":[]},{"name":"dense_Dense1165","class_name":"Dense","config":{"units":9,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1165","trainable":true,"batch_input_shape":[null,16],"dtype":"float32"},"inbound_nodes":[[["dense_Dense1165_input",0,0,{}]]]},{"name":"dense_Dense1166","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1166","trainable":true},"inbound_nodes":[[["dense_Dense1165",0,0,{}]]]},{"name":"dense_Dense1167","class_name":"Dense","config":{"units":5,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1167","trainable":true},"inbound_nodes":[[["dense_Dense1166",0,0,{}]]]}],"input_layers":[["dense_Dense1165_input",0,0]],"output_layers":[["dense_Dense1167",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense1165/kernel","shape":[16,9],"dtype":"float32"},{"name":"dense_Dense1165/bias","shape":[9],"dtype":"float32"},{"name":"dense_Dense1166/kernel","shape":[9,7],"dtype":"float32"},{"name":"dense_Dense1166/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense1167/kernel","shape":[7,5],"dtype":"float32"},{"name":"dense_Dense1167/bias","shape":[5],"dtype":"float32"}]}]}