{"modelTopology":{"class_name":"Model","config":{"name":"sequential_258_model","layers":[{"name":"dense_Dense757_input","class_name":"InputLayer","config":{"batch_input_shape":[null,12],"dtype":"float32","sparse":false,"name":"dense_Dense757_input"},"inbound_nodes":[]},{"name":"dense_Dense757","class_name":"Dense","config":{"units":10,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense757","trainable":true,"batch_input_shape":[null,12],"dtype":"float32"},"inbound_nodes":[[["dense_Dense757_input",0,0,{}]]]},{"name":"dense_Dense758","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense758","trainable":true},"inbound_nodes":[[["dense_Dense757",0,0,{}]]]},{"name":"dense_Dense759","class_name":"Dense","config":{"units":5,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense759","trainable":true},"inbound_nodes":[[["dense_Dense758",0,0,{}]]]}],"input_layers":[["dense_Dense757_input",0,0]],"output_layers":[["dense_Dense759",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense757/kernel","shape":[12,10],"dtype":"float32"},{"name":"dense_Dense757/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense758/kernel","shape":[10,7],"dtype":"float32"},{"name":"dense_Dense758/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense759/kernel","shape":[7,5],"dtype":"float32"},{"name":"dense_Dense759/bias","shape":[5],"dtype":"float32"}]}]}