{"modelTopology":{"class_name":"Model","config":{"name":"sequential_3586_model","layers":[{"name":"dense_Dense7681_input","class_name":"InputLayer","config":{"batch_input_shape":[null,26],"dtype":"float32","sparse":false,"name":"dense_Dense7681_input"},"inbound_nodes":[]},{"name":"dense_Dense7681","class_name":"Dense","config":{"units":20,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7681","trainable":true,"batch_input_shape":[null,26],"dtype":"float32"},"inbound_nodes":[[["dense_Dense7681_input",0,0,{}]]]},{"name":"dense_Dense7682","class_name":"Dense","config":{"units":20,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7682","trainable":true},"inbound_nodes":[[["dense_Dense7681",0,0,{}]]]},{"name":"dense_Dense7683","class_name":"Dense","config":{"units":3,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7683","trainable":true},"inbound_nodes":[[["dense_Dense7682",0,0,{}]]]}],"input_layers":[["dense_Dense7681_input",0,0]],"output_layers":[["dense_Dense7683",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense7681/kernel","shape":[26,20],"dtype":"float32"},{"name":"dense_Dense7681/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense7682/kernel","shape":[20,20],"dtype":"float32"},{"name":"dense_Dense7682/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense7683/kernel","shape":[20,3],"dtype":"float32"},{"name":"dense_Dense7683/bias","shape":[3],"dtype":"float32"}]}]}