{"modelTopology":{"class_name":"Model","config":{"name":"sequential_1026_model","layers":[{"name":"dense_Dense3313_input","class_name":"InputLayer","config":{"batch_input_shape":[null,15],"dtype":"float32","sparse":false,"name":"dense_Dense3313_input"},"inbound_nodes":[]},{"name":"dense_Dense3313","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3313","trainable":true,"batch_input_shape":[null,15],"dtype":"float32"},"inbound_nodes":[[["dense_Dense3313_input",0,0,{}]]]},{"name":"dense_Dense3314","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3314","trainable":true},"inbound_nodes":[[["dense_Dense3313",0,0,{}]]]},{"name":"dense_Dense3315","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3315","trainable":true},"inbound_nodes":[[["dense_Dense3314",0,0,{}]]]},{"name":"dense_Dense3316","class_name":"Dense","config":{"units":6,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3316","trainable":true},"inbound_nodes":[[["dense_Dense3315",0,0,{}]]]}],"input_layers":[["dense_Dense3313_input",0,0]],"output_layers":[["dense_Dense3316",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense3313/kernel","shape":[15,7],"dtype":"float32"},{"name":"dense_Dense3313/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense3314/kernel","shape":[7,7],"dtype":"float32"},{"name":"dense_Dense3314/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense3315/kernel","shape":[7,7],"dtype":"float32"},{"name":"dense_Dense3315/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense3316/kernel","shape":[7,6],"dtype":"float32"},{"name":"dense_Dense3316/bias","shape":[6],"dtype":"float32"}]}]}