{"modelTopology":{"class_name":"Model","config":{"name":"sequential_514_model","layers":[{"name":"dense_Dense1377_input","class_name":"InputLayer","config":{"batch_input_shape":[null,44],"dtype":"float32","sparse":false,"name":"dense_Dense1377_input"},"inbound_nodes":[]},{"name":"dense_Dense1377","class_name":"Dense","config":{"units":33,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1377","trainable":true,"batch_input_shape":[null,44],"dtype":"float32"},"inbound_nodes":[[["dense_Dense1377_input",0,0,{}]]]},{"name":"dense_Dense1378","class_name":"Dense","config":{"units":33,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1378","trainable":true},"inbound_nodes":[[["dense_Dense1377",0,0,{}]]]},{"name":"dense_Dense1379","class_name":"Dense","config":{"units":33,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1379","trainable":true},"inbound_nodes":[[["dense_Dense1378",0,0,{}]]]},{"name":"dense_Dense1380","class_name":"Dense","config":{"units":3,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1380","trainable":true},"inbound_nodes":[[["dense_Dense1379",0,0,{}]]]}],"input_layers":[["dense_Dense1377_input",0,0]],"output_layers":[["dense_Dense1380",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense1377/kernel","shape":[44,33],"dtype":"float32"},{"name":"dense_Dense1377/bias","shape":[33],"dtype":"float32"},{"name":"dense_Dense1378/kernel","shape":[33,33],"dtype":"float32"},{"name":"dense_Dense1378/bias","shape":[33],"dtype":"float32"},{"name":"dense_Dense1379/kernel","shape":[33,33],"dtype":"float32"},{"name":"dense_Dense1379/bias","shape":[33],"dtype":"float32"},{"name":"dense_Dense1380/kernel","shape":[33,3],"dtype":"float32"},{"name":"dense_Dense1380/bias","shape":[3],"dtype":"float32"}]}]}