{"modelTopology":{"class_name":"Model","config":{"name":"sequential_261_model","layers":[{"name":"dense_Dense748_input","class_name":"InputLayer","config":{"batch_input_shape":[null,14],"dtype":"float32","sparse":false,"name":"dense_Dense748_input"},"inbound_nodes":[]},{"name":"dense_Dense748","class_name":"Dense","config":{"units":10,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense748","trainable":true,"batch_input_shape":[null,14],"dtype":"float32"},"inbound_nodes":[[["dense_Dense748_input",0,0,{}]]]},{"name":"dense_Dense749","class_name":"Dense","config":{"units":10,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense749","trainable":true},"inbound_nodes":[[["dense_Dense748",0,0,{}]]]},{"name":"dense_Dense750","class_name":"Dense","config":{"units":6,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense750","trainable":true},"inbound_nodes":[[["dense_Dense749",0,0,{}]]]}],"input_layers":[["dense_Dense748_input",0,0]],"output_layers":[["dense_Dense750",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense748/kernel","shape":[14,10],"dtype":"float32"},{"name":"dense_Dense748/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense749/kernel","shape":[10,10],"dtype":"float32"},{"name":"dense_Dense749/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense750/kernel","shape":[10,6],"dtype":"float32"},{"name":"dense_Dense750/bias","shape":[6],"dtype":"float32"}]}]}