{"modelTopology":{"class_name":"Model","config":{"name":"sequential_515_model","layers":[{"name":"dense_Dense1432_input","class_name":"InputLayer","config":{"batch_input_shape":[null,13],"dtype":"float32","sparse":false,"name":"dense_Dense1432_input"},"inbound_nodes":[]},{"name":"dense_Dense1432","class_name":"Dense","config":{"units":10,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1432","trainable":true,"batch_input_shape":[null,13],"dtype":"float32"},"inbound_nodes":[[["dense_Dense1432_input",0,0,{}]]]},{"name":"dense_Dense1433","class_name":"Dense","config":{"units":7,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1433","trainable":true},"inbound_nodes":[[["dense_Dense1432",0,0,{}]]]},{"name":"dense_Dense1434","class_name":"Dense","config":{"units":5,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1434","trainable":true},"inbound_nodes":[[["dense_Dense1433",0,0,{}]]]}],"input_layers":[["dense_Dense1432_input",0,0]],"output_layers":[["dense_Dense1434",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense1432/kernel","shape":[13,10],"dtype":"float32"},{"name":"dense_Dense1432/bias","shape":[10],"dtype":"float32"},{"name":"dense_Dense1433/kernel","shape":[10,7],"dtype":"float32"},{"name":"dense_Dense1433/bias","shape":[7],"dtype":"float32"},{"name":"dense_Dense1434/kernel","shape":[7,5],"dtype":"float32"},{"name":"dense_Dense1434/bias","shape":[5],"dtype":"float32"}]}]}