{"modelTopology":{"class_name":"Model","config":{"name":"sequential_1026_model","layers":[{"name":"dense_Dense2524_input","class_name":"InputLayer","config":{"batch_input_shape":[null,16],"dtype":"float32","sparse":false,"name":"dense_Dense2524_input"},"inbound_nodes":[]},{"name":"dense_Dense2524","class_name":"Dense","config":{"units":12,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2524","trainable":true,"batch_input_shape":[null,16],"dtype":"float32"},"inbound_nodes":[[["dense_Dense2524_input",0,0,{}]]]},{"name":"dense_Dense2525","class_name":"Dense","config":{"units":12,"activation":"selu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2525","trainable":true},"inbound_nodes":[[["dense_Dense2524",0,0,{}]]]},{"name":"dense_Dense2526","class_name":"Dense","config":{"units":5,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2526","trainable":true},"inbound_nodes":[[["dense_Dense2525",0,0,{}]]]}],"input_layers":[["dense_Dense2524_input",0,0]],"output_layers":[["dense_Dense2526",0,0]]},"keras_version":"tfjs-layers 1.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.0.0","convertedBy":null,"weightsManifest":[{"paths":["./PTModel2.weights.bin"],"weights":[{"name":"dense_Dense2524/kernel","shape":[16,12],"dtype":"float32"},{"name":"dense_Dense2524/bias","shape":[12],"dtype":"float32"},{"name":"dense_Dense2525/kernel","shape":[12,12],"dtype":"float32"},{"name":"dense_Dense2525/bias","shape":[12],"dtype":"float32"},{"name":"dense_Dense2526/kernel","shape":[12,5],"dtype":"float32"},{"name":"dense_Dense2526/bias","shape":[5],"dtype":"float32"}]}]}